<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006~2016 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------
return [
//    'URL_MODEL' =>'2',
    // +----------------------------------------------------------------------
    // | 模板替换
    // +---------------------------------------------------------------------- 
    'view_replace_str'  =>  [
        '__PUBLIC__'=>'/public/',
        '__ROOT__' => '/',
        '__STATIC__' => '/public/static/' 
    ],
    // +----------------------------------------------------------------------
    // | 用户相关设置 
	// +----------------------------------------------------------------------
    'user_max_cache'     => 1000, //最大缓存用户数
    'user_administrator' => 1, //管理员用户ID 
    // +----------------------------------------------------------------------
    // | 图片上传相关配置
    // +----------------------------------------------------------------------
    'picture_upload' => array(
    		'size'  => 2*1024*1024, //上传的文件大小限制 (0-不做限制)
    		'ext'     => 'jpg,gif,png,jpeg', //允许上传的文件后缀
    		'rootPath' => './uploads/picture/', //保存根路径
    		'saveName' => 'date', //上传文件命名规则 date   md5 	 sha1
    		'replace'  => false, //存在同名是否覆盖
    ),
    // +----------------------------------------------------------------------
    // | 文件上传相关配置 
    // +----------------------------------------------------------------------
    'download_upload' => array(
    		'size'  => 2*1024*1024, //上传的文件大小限制 (0-不做限制)
    		'ext'     => 'jpg,gif,png,jpeg,zip,rar,tar,gz,7z,doc,docx,txt,xml', //允许上传的文件后缀
    		'rootPath' => './uploads/download/', //保存根路径
    		'saveName' => 'date', //上传文件命名规则 date   md5 	 sha1
    		'replace'  => false, //存在同名是否覆盖
    ),
    // +----------------------------------------------------------------------
    // | 编辑器图片上传相关配置
    // +----------------------------------------------------------------------
    'editor_upload' => array(
    		'mimes'    => '', //允许上传的文件MiMe类型
    		'size'  => 2*1024*1024, //上传的文件大小限制 (0-不做限制)
    		'ext'     => 'jpg,gif,png,jpeg', //允许上传的文件后缀
    		'autoSub'  => true, //自动子目录保存文件
    		'subName'  => array('date', 'Y-m-d'), //子目录创建方式，[0]-函数名，[1]-参数，多个参数使用数组
    		'rootPath' => './uploads/editor/', //保存根路径
    	//	'savePath' => '', //保存路径
    	//	'saveName' => array('uniqid', ''), //上传文件命名规则，[0]-函数名，[1]-参数，多个参数使用数组
    		'saveName' => 'date', //上传文件命名规则 date   md5 	 sha1
    		'saveExt'  => '', //文件保存后缀，空则使用原后缀
    		'replace'  => false, //存在同名是否覆盖
    		'hash'     => true, //是否生成hash编码
    		'callback' => false, //检测文件是否存在回调函数，如果存在返回文件信息数组
    ),
    // +----------------------------------------------------------------------
    // | 文档模型配置 (文档模型核心配置，请勿更改)
    // +----------------------------------------------------------------------
    'document_model_type' => array(2 => '主题', 1 => '目录', 3 => '段落'),
    // +----------------------------------------------------------------------
    // | 系统数据加密设置
    // +----------------------------------------------------------------------
    'data_auth_key' => 'G!3SkbZxJNj0H}8ptA1`]wu[Ws_dMDoEn^,Um?="', //默认数据加密KEY
    'data_cache_key'=> 'G!3SkbZxJNj0H}8ptA1`]wu[Ws_dMDoEn^,Um?="',
    
	 'addons'=>[
	    // 是否自动读取取插件钩子配置信息（默认是关闭）
	    'autoload' => true,
	    // 当关闭自动获取配置时需要手动配置hooks信息
	    'hooks' => [
		    // 可以定义多个钩子
	     //   'testhook'=>'test' // 键为钩子名称，用于在业务中自定义钩子处理，值为实现该钩子的插件，
						// 多个插件可以用数组也可以用逗号分割
		]
	]
];  